<a href="https://colab.research.google.com/github/tongtiger/KUanwjrrlrP/blob/master/kaggle/titanic/data/preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import re

In [ ]:
train_data = pd.read_csv("/content/drive/Shared drives/Kaggle/titanic/data/train.csv")
train_dataframe = pd.DataFrame(train_data)

#column 이름
column_index = []

for column in train_dataframe.columns:
    column_index.append(column)

column_index

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [ ]:
train_dataframe.isnull()

     PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0          False     False   False  False  ...   False  False   True     False
1          False     False   False  False  ...   False  False  False     False
2          False     False   False  False  ...   False  False   True     False
3          False     False   False  False  ...   False  False  False     False
4          False     False   False  False  ...   False  False   True     False
..           ...       ...     ...    ...  ...     ...    ...    ...       ...
886        False     False   False  False  ...   False  False   True     False
887        False     False   False  False  ...   False  False  False     False
888        False     False   False  False  ...   False  False   True     False
889        False     False   False  False  ...   False  False  False     False
890        False     False   False  False  ...   False  False   True     False

[891 rows x 12 columns]

In [ ]:
#pandas Dataframe에서 결측치를 특정한 값으로 치환해주는 함수,
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html
train_dataframe = train_dataframe.fillna(0, axis=1)

train_dataframe

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500     0         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250     0         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500     0         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000     0         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500     0         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500     0         Q

[891 rows x 12 columns]

In [ ]:
#'Sex' 칼럼의 데이터를 'male'은 1로, 'female'은 0으로 치환하기
train_dataframe = train_dataframe.replace(to_replace="male", value= 1)
train_dataframe = train_dataframe.replace(to_replace="female", value= 0)

train_dataframe['Sex']

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 891, dtype: int64

In [ ]:
#'Ticket' 칼럼의 데이터 중 str이 포함되어 있는 티켓 값은 전부 0으로 치환

str_finder = re.compile("\D")

for data in train_dataframe['Ticket']:
    if str_finder.search(str(data)):
        train_dataframe = train_dataframe.replace({'Ticket': data}, {'Ticket': 0})

train_dataframe['Ticket'] = pd.to_numeric(train_dataframe['Ticket'])

train_dataframe['Ticket']

0           0
1           0
2           0
3      113803
4      373450
        ...
886    211536
887    112053
888         0
889    111369
890    370376
Name: Ticket, Length: 891, dtype: int64

#TypeError: expected string or bytes-like object

[TypeError 해결책](https://soraji.github.io/python/2019/07/21/rex/)

In [ ]:
#'Embarked" 칼럼의 데이터를 숫자로 변경
embarked_data = []

for data in train_dataframe['Embarked']:
    if data not in embarked_data:
        embarked_data.append(data)

k = 1/3 #이 과정의 경우 학습 시 Y 값이 'Embarked'의 데이터가 아니기 때문에 불필요함.

for data in embarked_data:
    if data != 0:
        train_dataframe = train_dataframe.replace(to_replace=data, value = k)
        k += 1/3

train_dataframe['Embarked']

0      0.333333
1      0.666667
2      0.333333
3      0.333333
4      0.333333
         ...
886    0.333333
887    0.333333
888    0.333333
889    0.666667
890    1.000000
Name: Embarked, Length: 891, dtype: float64

In [ ]:
#'Cabin' 칼럼에 0을 제외한 데이터들을 전부 숫자로 치환해주기
cabin = {}

a = 1

for data in train_dataframe['Cabin']:
    if data != 0:
        if data not in cabin:
            cabin[data] = a
            a += 1

#print(max(list(cabin.values()))) = 147, 이 과정의 경우 학습 시 Y 값이 'Cabin'의 데이터가 아니기 때문에 불필요함.

for key, value in cabin.items():
    cabin[key] = value/147

for data in train_dataframe['Cabin']:
    if data != 0:
        train_dataframe = train_dataframe.replace(to_replace=data, value=cabin[data])

train_dataframe['Cabin']

0      0.000000
1      0.006803
2      0.000000
3      0.013605
4      0.000000
         ...
886    0.000000
887    0.993197
888    0.000000
889    1.000000
890    0.000000
Name: Cabin, Length: 891, dtype: float64

In [ ]:
#train_dataframe = train_dataframe.drop(columns = ['PassengerId', 'Name'])

train_dataframe.info()

#train_dataframe.to_csv("data/train_data.csv")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int64
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Ticket    891 non-null    int64
 7   Fare      891 non-null    float64
 8   Cabin     891 non-null    float64
 9   Embarked  891 non-null    float64
dtypes: float64(4), int64(6)
memory usage: 69.7 KB